# Задание 27
mass = [1, 2, 3, 4, 5, 6, 7, 8, 5, 3, 'ASD', "ALLO", 3.45432, 3, "lodka", True, False]
mass1 = [1, 'ALLO', 4, "ASD", 2, 10, 6, True, 2, 3, 4, "lodka", 6, 7, 8, 5, 3, 'ASD', "ALLO", 3.45432, 3, "lodka", True, False]
mass3 = []
for i in mass + mass1:
    mass3.append(i)
mass3 = set(mass3)
print(mass3)
# Задание 28
print("Не знаю, матрицу не прошел, а на паре не объяснили")
# Задание 29
print("Не знаю, матрицу не прошел, а на паре не объяснили")
# Задание 30
print("Не знаю, матрицу не прошел, а на паре не объяснили")
# Задание 31
print("Не знаю, матрицу не прошел, а на паре не объяснили")